--- a/docs/12-connectors/05-description/30-compliance-provider.md
+++ b/docs/12-connectors/05-description/30-compliance-provider.md
@@ -31,52 +31,72 @@ The table below shows the provider specific objects that are part of the provide
+### Add Compliance Provider
 
 
-```mermaid
-sequenceDiagram
-    autonumber
-    
-    Client->>Core: Add a new Compliance Provider
-    Core->>Compliance Provider: Get list of Kinds and End Points
-    Compliance Provider->>Core: List of Kinds and End Points
-    Core->>Compliance Provider: Get list of Groups and Rules
-    Compliance Provider->>Core: List of Groups and Rules
-    Core->>Client: Connector added response
+```plantuml
+    @startuml
+    skinparam topurl https://docs.czertainly.com/api/
+        Client -> Core [[core-connector/#tag/Connector-Management-API/operation/createConnector]]: Add Compliance Provider
+        note over Client,Core: Add New Connector
+        Core -> Connector [[connector-compliance-provider/#tag/Info-API/operation/listSupportedFunctions]]: Get Function Group and Kind
+        note over Core,Connector: Function Group Details
+        Connector --> Core: Function Group and Kind
+        |||
+        Core -> Connector [[connector-compliance-provider/#tag/Compliance-Rules-API/operation/getRules]]: List Compliance Rules
+        note over Core,Connector: Compliance Rules and Groups
+        Connector --> Core: List Compliance Rules
+        |||
+        Core -> Connector [[connector-compliance-provider/#tag/Compliance-Rules-API/operation/getGroups]]: List Compliance Groups
+        Connector --> Core: List Compliance Groups
+        |||
+        Core -> Core: Store Rules and Groups
+        Core -> Client: Return Connector UUID
+    @enduml
 ```
 
-### Compliance
+### Check Certificate Compliance
